In [9]:
import pandas as pd

In [4]:
pd.read_csv('friends.csv')

   Unnamed: 0      Name  Marks       City
0           0    Hardik     30     Meerut
1           1   Tanisha     45      Kalka
2           2  Rashmika     60  Panchkula
3           3  Tripathi     34    Lucknow

In [22]:
df = pd.read_csv('friends.csv')

In [23]:
df

   Unnamed: 0      Name  Marks       City
0           0    Hardik     30     Meerut
1           1   Tanisha     45      Kalka
2           2  Rashmika     60  Panchkula
3           3  Tripathi     34    Lucknow

In [10]:
df.to_html('frie_output',index=False)

In [20]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [24]:
df.to_excel('Excel_samp2.xlsx',sheet_name='NewSheet')

In [25]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [29]:
data

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                  First Republic Bank      San Francisco      CA     59017
 1                       Signature Bank           New York      NY     57053
 2                  Silicon Valley Bank        Santa Clara      CA     24735
 3                    Almena State Bank             Almena      KS     15426
 4           First City Bank of Florida  Fort Walton Beach      FL     16748
 ..                                 ...                ...     ...       ...
 561                 Superior Bank, FSB           Hinsdale      IL     32646
 562                Malta National Bank              Malta      OH      6629
 563    First Alliance Bank & Trust Co.         Manchester      NH     34264
 564  National State Bank of Metropolis         Metropolis      IL      3815
 565                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
 1                    Flagstar Bank, N.A.      March 12, 2023     10540
 2    First–Citizens Bank & Trust Company      March 10, 2023     10539
 3                            Equity Bank    October 23, 2020     10538
 4              United Fidelity Bank, fsb    October 16, 2020     10537
 ..                                   ...                 ...       ...
 561                Superior Federal, FSB       July 27, 2001      6004
 562                    North Valley Bank         May 3, 2001      4648
 563  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 564              Banterra Bank of Marion   December 14, 2000      4646
 565                   Bank of the Orient    October 13, 2000      4645

 [566 rows x 7 columns]]

In [30]:
data[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
1,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
2,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
3,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
4,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537